#define  _CRT_SECURE_NO_WARNINGS 1
//数据的存储
//练习6：

//int main()
//{
//	char a[1000];//char取值范围是-128-127 
//	int i;
//	for (i = 0; i<1000; i++)
//	{
//		//顺序是-1、-2、-3、、、、-128、127、126、、、3、2、1、0
//		a[i] = -1 - i;
//	}
//
//	printf("%d", strlen(a));
//	return 0;
//}


//练习7：
//#include <stdio.h>
//unsigned char i = 0;//0-255
//int main()
//{
//	for (i = 0; i <= 255; i++)//恒成立 
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}




//浮点型在内存中的存储
//任意一个二进制浮点数V可以表示成下面的形式：
//(-1) ^ S * M * 2 ^ E
//(-1) ^ s表示符号位，当s = 0，V为正数；当s = 1，V为负数。
//M表示有效数字，大于等于1，小于2。
//2 ^ E表示指数位
//存储的时候：S直接存 M去掉小数点前的1 E加127/1023
//例如：
#include<stdio.h>
int main()
{
	float a = 5.5;
	//5.5
	//101.1
	//(-1)^0  *  1.011 * 2^2
	//     S       M      E
	//0100 0000 1011 0000 0000 0000 0000 0000
	//40 B0 00 00
	return 0;
}